using System;
using System.Windows.Forms;
using MoviesApp.Data.Model;
using System.Drawing;
using MoviesApp.Presentation;
using System.IO;
using System.Collections.Generic;
using MoviesApp.Business;
using System.Linq;
using MoviesApp.Resources;
using System.Diagnostics;


namespace MoviesApp
{
    /// <summary>
    /// Началната форма на приложението.
    /// Наследява базовия клас Form, който е родителски клас на всички форми
    /// От тази форма стартира приложението и тя води към останалите.
    /// </summary>
    public partial class Form1 : Form
    {
        /// <summary>
        /// Конструктор на формата
        /// </summary>
        public Form1()
        {
            InitializeComponent();

        }
        /// <summary>
        /// Метод, активиращ се при зареждане на началната форма
        /// От този метод се извиква друг, който зарежда началното попълване на базата данни
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void Form1_Load(object sender, EventArgs e)
        {
            this.FormBorderStyle = FormBorderStyle.FixedSingle;
            labelError.Visible = false;
            this.CenterToScreen();
            EnsureDateBaseIsCreated();
            pictureBox2.Visible = true;
            VisualizeMainPictureBoxes();
        }
        MovieBusiness bc;
        string description = "";
        int countMovieInCollection = 1;

        /// <summary>
        /// Метод, който попълва базтата данни.
        /// </summary>
        private void FullDatabase()
        {
            List<string> descriptions = new List<string>();
            descriptions.Add("15 април 1912 година. Трагичната гибел на най-големия и луксозен за времето си кораб" +
                " с 2 223 пътника на борда си обикаля света и хвърля в покруса милиони хора." +
                " За по-малко от три часа хиляди пасажери са погълнати от ледените води на океана." +
                " Фаталният слъсък на презокеанския лайнер \"Титаник\" с гигантски айсберг е една от най-трагичните катастрофи в историята на мореплаването," +
                " но ведно с това и символ на човешкото страдание."); // Титаник
            descriptions.Add("Филмът представя непознат свят през погледа на прикования към инвалидна количка," +
                " бивш морски пехотинец Джейк Съли. Въпреки болното си тяло, Джейк продължава да е войн по душа." +
                " Той е вербуван за далечна мисия, да пътува до отдалечената на светлинни години планета Пандора," +
                " на която корпоративна организация добива рядък минерал, ключ към разрешаването на енергийната криза на Земята." +
                " Тъй като атмосферата на Пандора е силно токсична, е създадена Програма АВАТАР," +
                " чрез която човешкото съзнание се прикрепя към управлявано от разстояние биологично тяло, способно да живее в смъртоносната среда." +
                " „Аватарите” са генетично създадени хибриди на човешка  ДНК и ДНК на жителите на Пандора – Нави."); // Аватар
            descriptions.Add("Разказва се за хуманоиден робот – Терминатор, който е транспортиран назад във времето от 2029 г. в 1984 г." +
                " (датата е 12 май), за да убие жена на име Сара Конър. В същото време назад във времето е пратен и мъж, Кайл Рийс," +
                " който да предпази Конър от киборга. Темите, засегнати във филма, включват пътуване във времето, причинно-следствен цикъл и изкуствен интелект."); // Терминаторът
            descriptions.Add("Какво може да се обърка след едноседмично пътуване с дядо?" +
                " Ами...всичко! Точно преди сватбата си, Джейсън (Зак Ефрон)" +
                " е подлъган да откара дядо си - бивш генерал - в слънчева Флорида," +
                " за да посрещне там \"по мъжки\" началото на пролетта.На него му остава" +
                " само седмица до сватбата с властната дъщеря на шефа му, от когото зависи" +
                " да се издигне до съдружник. Но подтикнат от дядо си - цапнатия в устата Дик (Робърт Де Ниро)," +
                " Джейсън се оказва на път към Дейтона Бийч..."); // Ох на Дядо 
            descriptions.Add("Бела Суон (Кристън Стюарт) никога не е приличала на момичетата от нейното училище във Финикс, Аризона." +
                " Когато майка й Рене (Сара Кларк) се омъжва за втори път и се премества със съпруга си във Флорида, Бела решава да живее с баща си Чарли (Били Бърк)" +
                " в малкото дъждовно градче Форкс. Не очаква нещо да се промени, докато не среща тайнствения и невероятно красив Едуард Кълън (Робърт Патинсън). " +
                "Той е различен от всички, които е срещала – интелигентен и духовит. Бела и Едуард се впускат в страстна и различна от общоприетите норми връзка." +
                " Едуард може да бяга по- бързо от всеки леорпард, може да спре кола с голи ръце и не е се е променил от 1918 насам. И най – важното - той е вампир..."); // Здрач
            descriptions.Add("От десетилетия, хората от Дагърхорн подържат нелеко примирие с върколака, като му принасят в жертва по едно животно, всяко новолуние," +
                " когато звярът излиза за плячка. Но когато настъпва кървавочервената луна, той отнема човешки живот. Жертвата е по-голямата сестра на Валъри, която току-що е разбрала," +
                " че родителите й са уредили брака й с Хенри, потомък на една от най-богатите фамилии в селото. Валъри обаче, желае единствено бедния дървар Питър," +
                " когото е обичала през целия си живот. За да предотвратят нежеланата раздяла, влюбените планират бягство, но вълкът променя нещата по ужасяващ начин."); // Червената шапчица
            descriptions.Add("Когато се появява неочакван враг, заплашващ глобалната сигурност, Ник Фюри, директор на международната мироопазваща агенция," +
                " известна под името ЩИТ изпитва остра нужда от екип, който да спаси света от надвисналата катастрофа."); // Отмъстителите
            descriptions.Add("Повече от 200 години след гибелта на лейтенант Рипли. Военни учения, в опит за създаване на съвършеното оръжие, възвръщат главната героиня към живот, като я клонират." +
                " Кръвта на Рипли носи в себе си образец ДНК от „Пришълеца“, и военните искат тя да роди дете – наполовина човек, наполовина „Пришълец“."); // Пришълецът
            descriptions.Add("В центъра на сюжета в „Синята лагуна: Пробуждане / Blue Lagoon: The Awakening (2012)“, са двама тийнейджъри Ема и Дийн, които попадат на необитаем остров в Карибско море." +
                " По време на разходка с корабче, Ема пада зад борда, а само Дийн вижда и скоча след нея в морето. Седмици минават и младите хора се влюбват, научават много един за друг, както и за себе си."); // Синята Лагуна
            descriptions.Add("Това е Анабел – кукла закупена през 1970 г. от младо момиче. След като привидно обикновената играчка попаднала в дома на девойката, започнали да се случват странни неща – оставяне на бележки с надпис „Помощ“ из цялата къща." +
                " Приятел на семейството дори разказвал, че бил нападнат от куклата, когато им е бил на гости."); // Анабел
            descriptions.Add("Действието на филма е ситуирано в щата Роуд Айлънд, а сюжета проследява двойката Едуард и Лорейн Уорън, които са едни от най-известните и уважавани изследователи на паранормалните явления в Съединените щати." +
                " Най-новата им задача ги изпраща в отдалечена фермерска къща в която живее седемчленното семейство на Керълин и Роджър Перон. Керълин е убедена," +
                " че къщата е обладана от призрачни същества и твърденията й се превръщат в идеалната възможност за Едуард и Лорейн да изпробват всичките си техники и знания за връзка с отвъдното." +
                " Но скоро става ясно, че демоничните сили са много по-могъщи от очакваното."); // Заклинанието
            descriptions.Add("След като група тийнейджъри от американския Среден Запад изчезват мистериозно," +
                " местните хора приписват деянието на Кухия човек – страховито същество от популярна градска легенда."); // Кухият човек
            descriptions.Add("Честита смърт използва сюжетния похват „времева примка“ (популяризиран с голям успех от хита Омагьосън ден), за да разкаже за разхайтената колежанка Трий Гелбман (Джесика Рот, Ла Ла Ленд), която е принудена да преживява отново и отново деня на своята смърт, докато не разкрие самоличността на собствения си убиец.Докато бавно разплита мистерията около гибелта си, Трий вижда хората около себе си в непозната светлина и открива истини, които с лекота е подминавала в ежедневието си на купонджийка." +
                " За да успее да избяга от капана на повтарящия се ден, тя трябва да преоткрие света и най-вече себе си."); // Честита смърт 
            descriptions.Add("Годината е 1905. Томас Ричардсън се отправя към отдалечен остров, за да спаси сестра си, отвлечена от тайна религиозна общност. Там той се сблъсква с тайни и лъжи, " +
                "на които е основано това общество. Неговите членове, обаче горчиво ще съжаляват, че са обезпокоили Ричардсън."); // Апостол
            descriptions.Add("Дълбоко в сърцето на джакартските гета се извисява недостъпен дори за най-дръзките и безразсъдни ченгета блок," +
                " който служи за сигурно убежище на най-опасните убийци и гангстери. Под прикритието на мрака и необезпокояваната тишина на най-ранна утрин," +
                " елитен полицейски отряд се промъква в сградата, за да залови прословутия наркотрафикант, който я управлява."); // Щурмът
            descriptions.Add("Джо Гарднър е учител по музика в средно училище, който има дългогодишна мечта да свири джаз музика на сцена." +
                " Един ден той най-накрая получава този шанс, след като впечатлява група джаз."); // За душата
            descriptions.Add("Съли и неговия асистент Майк работят в компанията „Таласъми ООД” – най-голямата електроценрала в техния град, която генерира ток от писъците на изплашените деца. Таласъмите вярват, че децата са опасни създания и когато едно малко момиченце случайно прониква в техния свят," +
                " той се преобръща с главата надолу. Съли и Майк трябва да направят всичко възможно, за да я върнат у дома."); //Таласъми ООД
            descriptions.Add("Филмът ни отвежда на един остров, населен изцяло от щастливи, нелетящи птици - или почти изцяло. Изнервеният Ред (озвучен на български от Слави Трифонов), бързакът Чък (Иво Сиромахов) и избухливият Бомб (Стоян Цветков) така и не успяват да се впишат в този рай." +
                " Но когато на острова пристигат загадъчни зелени прасенца, точно тези аутсайдери ще предвидят какво са замислили нашествениците."); //Angry Birds: Филмът
            descriptions.Add("В \"Аз, проклетникът 2\" Гру е оставил карерата си на супер престъпник и се е посветил на отглеждането на Марго, Едит и Агнес. Сега той, д-р Нефарио и жълтите слуги разполагат със свободно време, което трябва да запълнят." +
                " Едва свикнал с ролята си на семеен човек от предградията, натоварен с нелеката задача да се грижи за три малки момиченца, Гру се сблъсква с хипер секретна организация, която се бори със злото по света." +
                " В неговите и ръцете на новата му партньорка Луси Уайлд е отговорността да се разкрие кой стои зад едно от най-големите престъпление и злодеят да бъде наказан." +
                " В крайна сметка именно бившият най-голям злодей е изправен пред предизвикателството да залови своя заместник."); //  Аз, проклетникът 2
            descriptions.Add("Индиана Джоунс попада в Индия заедно със спътниците си Уили Скот (Кейт Кепшоу) и Малчо (Джонатан Ке Куан)." +
                " Тримата се озовават в село, сполетяно от голямо нещастие — група сектанти, кланящи се на богинята Кали," +
                " са отвлекли децата им и са откраднали свещен камък, който е носел плодородие. Д-р Джоунс, Уили и Малчо предприемат пътуване към близкия храм," +
                " за да спасят децата и върнат камъка в селото. След като отиват в дворгеца Панкот, махараджата(който е дете) ги посреща добре," +
                " нахранва ги и им осигурява спални. Когато Инди отива в стаята си, заедно с Малчо го напада тхуг. Инди се опитва да го убие и накрая успява да го обеси." +
                " След това той отива в спалнята на Уили, където след като натиска една статуя се отваря таен проход към залата на жертвоприношенията." +
                " Преди това отиват в нещо като гробница, пълна с гадни и гнусни буболечки. След като тхугите извършват ритуалите и тръгват," +
                " Джоунс слиза долу и взема свещените камъни на Шанхара(почитан индуитски жрец), поставени в устата на Кали. "); // Индиана Джоунс
            descriptions.Add("Хобитът е също книга по едноименният автор Дж. Р. Р. Толкин и ще бъде пресъздадена от режисьора Питър Джаксън в три части." +
                " Първата част ни разкрива началото на историята и представяне на цялостната идея на филма. С нежелание хобита, Билбо Бегинс, има за цел да стигне Самотната планина с енергична група джуджета," +
                " за да си възстановят планински дом – и златото в нея – от дракона Смог. Историята се развива преди всеизвестната трилогията за пръстена."); // Хобит: Неочаквано пътешествие
            descriptions.Add("Питър Джаксън съживява тази фанатзия в удивително филмово приключение. " +
                "То представя незабравим герой - хобитът Фродо Багинс - въвлечен във война с митични мащаби в Средната земя: свят, пълен с вълшебство и магични умения." +
                "Но преди всичко филмът е апотеоз на преданото приятелство и личната смелост, които биха могли да надмогнат дори и най - разрушителните сили на мрака.! "); // Властелинът на пръстените: Задругата на пръстена
            descriptions.Add("Пол Уокър (“Дворец на илюзиите”) е в ролята на млад полицай под прикритие, който влиза в автомобилния екип на Вин Дизел (“Пълен мрак”), за да разследва серия от големи обири." +
                " Но когато някои от бандата започват да се съмняват в него, атмосферата се нажежава и ченгето бързо трябва да решава докъде се простира неговата лоялност…" +
                " Затегнете коланите и се впуснете в предизвикателното препускане с младия екип, който включва още Мишел Родригес и Джордана Брустър (“Факултетът”)." +
                " \"Бързи и яростни\" е замайващо екшън приключение… с високи скорости и горещи страсти. "); // Бързи и яростни
            descriptions.Add("Надпреварата вече не е само на пътя – в някои от каскадите автомобилите буквално летят след динамични превъртания," +
                " а в част от сцените се включват самолети и хеликоптери. На голям екран ще се появи и една от най-впечатляващите „атракции“ в продукцията – танк," +
                " разполагащ с достатъчно голям капацитет, за да бъде равностоен участник в уличната надпревара. За да бъде ефективен противник в тази неравна битка," +
                " отборът на Торето (Вин Дизел) ще използва всичките си умения и ще покаже най-доброто по отношение на каскади, въоръжена борба и физически схватки."); // Бързи и яростни 6
            descriptions.Add("Група десетгодишни деца отстояват независимостта си в училище, на улицата и вкъщи." +
                " Начините им да се противопоставят на възрастните и да преодолеят липсата на разбиране са толкова изобретателни," +
                " че те в края на краищата успяват да направят за посмешище родителите, учителите си и своите съседи. След много перипетии, успехи и неуспехи," +
                " и благодарение на детската солидарност, те успяват да отвоюват обратно футболната си топка, паднала в минаващ камион..."); // Таралежите се раждат без бодли
            descriptions.Add("Малкият Митко – Миташки (в ролята Веселин Прахов) е дете на разведени родители, живее с майка си, вечно заета със служебни събрания," +
                " и по цял ден стои сам вкъщи. Мечтае само за едно нещо — да си има куче — истинско, не плюшена играчка. Заедно с двама негови приятели," +
                " Андро (Мартин Стоянов) и Стефан (Емил Димитров) купуват от един крадец (Павел Поппандов) кучето Рошко за три лева и осемдесет стотинки и шест трамвайни билета." +
                " Тъй като Рошко е общо притежание, се редуват да го гледат и то така че родителите им да не разберат. "); // Куче в чекмедже
            descriptions.Add("1668 г. Османската империя е завладяла Югоизточна Европа, но свещената война за окончателното утвърждаване на исляма продължава." +
                " В Родопите е настанен военен корпус от еничари, предвождан от Караибрахим (Йосиф Сърчаджиев). Заедно с него пътува и Венецианеца (Валтер Тоски)," +
                " който вече е променил религията си. Местният владетел Сюлейман ага (Васил Михайлов) е убеден, че вярата не трябва да се променя по насилствен начин и е наказан със смърт за това." +
                " Сред хората, които трябва да се помохамеданчат, Караибрахим открива баща си (Константин Коцев), брат си Горан (Стойко Пеев)," +
                " сестра си Елица (Калина Стефанова) и най-близкия си приятел Манол (Иван Кръстев). Това не го разколебава да наложи исляма по най-жесток начин." +
                " Той пуска поп Алигорко (Руси Чанев), който е осъзнал, че единственият начин българите да оцелеят и запазят езика и обичаите си, е да пожертват вярата си. "); // Време разделно
            descriptions.Add("България от 20-те години на XX век. Пурко (Тодор Колев) е беден селски музикант, който непрекъснато измисля нови и нови начини да надхитря живота и да изхранва многолюдното си семейство." +
                " Преминавайки през редица смешни и тъжни приключения в борбата с немотията, един хубав ден той докосва мечтата си – превръща се в добре облечен градски господин." +
                " Дали обаче новата му самоличност ще пасне на свободната душа на музиканта? Илюзията рухва, но Пурко намира кураж отново да надуе своя кларинет. "); // Господин за един ден
            descriptions.Add("1945 г. Бойци от Първа българска армия водят тежки боеве за освобождаването на Унгария от хитлеристите." +
                " Към фронтовата линия пътуват трима войници от запаса - Иван, Спиро и Пейо. От цялото им поведение и външен вид личи, че са съвсем неподготвени за предстоящите битки." +
                " Постепенно тримата верни другари стигат до трагичния миг, който ги променя изцяло."); // Тримата от запаса
            descriptions.Add("В миналото, когато се развива действието на филма, краденето на моми е занаят, обичай и не се наказва от закона. Елица – млада, красива," +
                " трудолюбива и свободолюбива девойка бива открадната от Банко и неговите съдружници. Тя прави няколко неуспешни опита да избяга, но след като не успява," +
                " се моли на Банко поне той да я вземе за жена, а да не я дава на невзрачния младоженец, за когото я е откраднал. Банко обаче държи на мъжката си дума." +
                " По-късно обаче той разбира, че се е влюбил в нея и в края на филма бива убит, отстоявайки правото си да е с нея. "); // Мъжки времена
            descriptions.Add("Оскар Шиндлер е голям немски бизнесмен, който отваря фабрика в Полша през Втората Световна Война." +
         " Ставайки свидетел на зверствата от страна на нацистите върху еврейското население обаче," +
         " той става изключително човечев и превръща фабриката си в лагер на спасението за евреите." +
         " Филмът е базиран на истинската история на Оскар Шиндлер, който успява да спаси близо 1100 евреи от обгазяване в лагерите в Аушвиц."); // Списъкът на Шиндлер
            descriptions.Add("Съпругата на Уилям Уолъс (Мел Гибсън) е жестоко убита от английски войници." +
                " Личното му отмъщение постепенно се превръща в кръстоносен поход срещу Англия целящ да извоюва свободата на народа му," +
                " а легендите за невероятната му смелост вдъхновяват шотландците да поведат война срещу английските си потисници." +
                " \"Смело сърце\" разказва една вдъхновяваща история изпълнена със страст, предателство и безмерна смелост -" +
                " истинско постижение в историята на филмовото изкуство."); // Смело сърце
            descriptions.Add("Максимус е влиятелен римски генерал, обичан от народа и от застаряващия император Марк Аврелий." +
                " Преди смъртта си императорът избира Максимус за свой наследник вместо сина си Комодус и в борбата за власт Максимус и семейството му са осъдени на смърт." +
                " Генералът не успява да спаси семейството си и обзет от отчаяние, допуска да го пленят и да го принудят да участва в гладиаторските игри до смъртта си." +
                " Единственото, което го крепи, е възможността да стигне до върха, за да може да погледне в очите мъжа, който ще изпита отмъщението му."); // Гладиатор
            descriptions.Add("Това е историята на Джамал Малик (Дев Пател), 18 - годишен сирак от бедните квартали на Мумбай, който ще изживее най-вълнуващия ден от живота си." +
                " Цялата страна наблюдава неговата игра в индийската версия на телевизонната игра „Стани богат”. Един въпрос го дели от голямата награда - 20 милиона рупии." +
                " След края на предаването, полицията го задържа по подозрение за измама. Как дете от улицата би могло да знае толкова много? От отчаяние и за да докаже своята невинност," +
                " Джамал разказва за живота си в бедния квартал, в който са израснали двамата с брат му. За техните приключения на улицата, за жестоките сблъсъци с местните банди и" +
                " за Латика (Фрейда Пинто) - момичето, което е обичал и загубил. Всяка една глава от неговия живот му помога да отговори на въпросите от играта."); // Беднякът милионер
            descriptions.Add("Докато времето ни на Земята изтича, екип от изследователи се заема с най-важната мисия в историята на човечеството: пътуване извън познатата галактика," +
                " за да разбере дали сред звездите има бъдеще за хората."); // Интерстелар
            descriptions.Add("Рицарите джедаи са избити, а цялата галактика е в ръцете на Империята." +
                " Съпротива оказва единствено малка група Бунтовници, чието единствено преимущество са откраднатите планове на най-могъщото имперско оръжие" +
                " – бойната станция “Звезда на смъртта.” Задача да върне плановете и унищожи базата на бунтовниците, получава най-верният слуга на Империята – Дарт Вейдър." +
                " Плененият бунтовнически лидер принцеса Лея, е принудена да изпрати сигнал за помощ, който е уловен от обикновено селско момче на име Люк Скайуокър." +
                " Нетърпелив да изпълни предопределението на съдбата си, той се заема с тежката задача да помогне на Бунтовниците да победят Империята," +
                " а съюзници му стават мъдрия Оби Уан Кеноби, самонадеяния Хан Соло, предания Чубака и дроидите R2-D2 и Си Трипио."); // Междузвездни войни:Нова надежда
            descriptions.Add("Зрелищният финален епизод на “Междузвездни войни” отново ни среща с Люк Скайуокър и принцеса Лея." +
                " Те пътуват към Татуин, за да освободят пленения Хан Соло, затворен там от най-отвратителния престъпник на галактиката - Джаба Хътяниня." +
                " Отново в пълен състав, Бунтовниците се съюзяват с племената на Еуоките, за да продължат борбата с Имперските сили." +
                " В същото време, Императорът и Дарт Вейдър кроят планове как да примамят Люк към тъмната страна." +
                " Кулминация на Галактическата гражданска война настъпва с финалната атака на Бунтовниците над втората и недовършена “Звезда на смъртта”," +
                " а изходът от битката ще предопредели съдбата на цялата галактика."); // Междузвездни войни:Завръщането на джедаите
            descriptions.Add("Планът е изготвен. Правилата са ясни. Ако всичко върви добре за бандата от мошеници на Дани Оушън," +
                " възнаграждението ще е 150 милиона долара. Сума, разделена на 11. Направете си изчисленията." +
                " Джордж Клуни изпълнява ролята на Дани - той определя залаганията във високотехнологичен," +
                " разграфен до секунда обир на три казина. Набелязаните обекти са притежавани от стоманено-твърдия магнат (Анди Гарсия)," +
                " гадже на бившата жена на Дани (Джулия Робъртс). Посредник в далаверите (Брат Пит), джебчия (Мат Деймън), крупие (Бърни Мак)," +
                " специалист по взривове (Карл Райнър) и още няколко разпределени в точно определени роли престъпници се включват в гамбита на Дани." +
                " Влизате или излизате? Джакпотът е… взривяващо забавление."); // Бандата на Оушън
            descriptions.Add("Номиниран за 10 награди Оскар и носител на наградата за Най-добър филм," +
                " \"Роки\" успява да вдъхнови цяла една нация с прекрасна музика, невероятни битки и четирима актьори номинирани за Оскар!" +
                " Роки (Силвестър Сталоун) се бие за любов, слава и чест, но животът му е в задънена улица." +
                " Но когато съдбата го изправя срещу световния шампион тежка категория, Роки осъзнава," +
                " че има само един шанс – една възможност да спечели мача и да промени живота си!"); // Роки
            descriptions.Add("Карл Брашиър (Куба Гудинг Мл.) не допуска нищо да застане на пътя му." +
                " Син на изполичар от Кентъки, Карл напуска дома си, за да търси по-добър живот." +
                " “Никога не се предавай… бъди най-добрият!”, казва баща му и Карл взима тези думи присърце." +
                " Той се записва във Военноморския флот и кандидатства за водолаз в елитна дивизия, занимаваща се с издирвания и спасителни операции." +
                " Офицерът, обучаващ Карл, Били Сандей ( Робърт Де Ниро) не приема нито младежа, нито амбициите му." +
                " Той притиска Карл извън границите на човешката издръжливост в усилията си да го накара да се разколебае и предаде." +
                " Но с течение на времето двамата мъже се изпълват с взаимно уважение и в решителния момент влизат в бой рамо до рамо, за да защитят честта и живота си."); // Мъже на честта


            // directors
            List<Director> directors = new List<Director>();
            directors.Add(new Director("Джеймс", "Камерън")); // 1 - Титаник, Аватар, Терминаторът
            directors.Add(new Director("Дан", "Мейзър")); // 2 - Ох на Дядо
            directors.Add(new Director("Катрин", "Хардуик")); // 3 - Здрач, Червената шапчица
            directors.Add(new Director("Джос", "Уедън")); // 4 - Отмъстителите, Пришълецът
            directors.Add(new Director("Джейк", "Нюсом")); // 5 - Синята Лагуна
            directors.Add(new Director("Джон", "Р. Леонети")); // 6 - Анабел, Заклинанието
            directors.Add(new Director("Дейвид", "Прайър")); // 7 - Кухият човек
            directors.Add(new Director("Кристофър", "Ландън")); // 8 - Честита смърт
            directors.Add(new Director("Гарет", "Еванс")); // 9 - Апостол, Щурмът
            directors.Add(new Director("Пийт", "Доктър")); // 10 - За душата, Таласъми ООД
            directors.Add(new Director("Клай ", "Кайтис")); // 11 -  Angry Birds: Филмът
            directors.Add(new Director("Пиер", "Кофин")); // 12 -  Аз, проклетникът 2
            directors.Add(new Director("Джеймс", "Манголд")); // 13 - Индиана Джоунс
            directors.Add(new Director("Питър", "Джаксън")); // 14 - Хобит: Неочаквано пътешествие, Властелинът на пръстените: Задругата на пръстена
            directors.Add(new Director("Роб", "Коен")); // 15 - Бързи и яростни
            directors.Add(new Director("Джъстин", "Лин")); // 16 - Бързи и яростни 6
            directors.Add(new Director("Димитър", "Петров")); // 17 - Таралежите се раждат без бодли, Куче в чекмедже
            directors.Add(new Director("Людмил", "Стайков")); // 18 - Време разделно
            directors.Add(new Director("Николай", "Волев")); // 19 - Господин за един ден  
            directors.Add(new Director("Зако", "Хеския")); // 20 - Тримата от запаса
            directors.Add(new Director("Едуард", "Захариев")); // 21 - Мъжки времена
            directors.Add(new Director("Стивън", "Спилбърг")); // 22 - Списъкът на Шиндлер
            directors.Add(new Director("Мел", "Гибсън")); // 23 - Смело сърце
            directors.Add(new Director("Ридли", "Скот")); // 24 - Гладиатор
            directors.Add(new Director("Дани", "Бойл")); // 25 - Беднякът милионер
            directors.Add(new Director("Кристофър", "Нолан")); // 26 - Интерстелар
            directors.Add(new Director("Джордж", "Лукас")); // 27 - Междузвездни войни:Нова надежда, Междузвездни войни:Завръщането на джедаите7
            directors.Add(new Director("Стивън", "Содърбърг"));// 28 - Бандата на Оушън
            directors.Add(new Director("Джон", "Авилдсен")); // 29 - Роки
            directors.Add(new Director(" Джордж", "Тилмън-мл"));// 30 - Мъже на честта

            foreach (var d in directors)
            {
                bc.Add(d);
            }

            List<Genre> genres = new List<Genre>();
            genres.Add(new Genre("Екшън"));//1
            genres.Add(new Genre("Приключенски"));//2
            genres.Add(new Genre("Комедия"));//3
            genres.Add(new Genre("Криминален"));//4
            genres.Add(new Genre("Фентъзи"));//5
            genres.Add(new Genre("Научна фантастика"));//6
            genres.Add(new Genre("Исторически"));//7
            genres.Add(new Genre("Ужаси"));//8
            genres.Add(new Genre("Романтичен"));//9
            genres.Add(new Genre("Трилър"));//10
            genres.Add(new Genre("Анимация"));//11
            genres.Add(new Genre("Драма"));//12
            foreach (var g in genres)
            {
                bc.Add(g);
            }

            List<int> genresId;
            List<Movie> movies = new List<Movie>();

            description = descriptions[0];
            movies.Add(new Movie("Титаник", 1997, 210, "САЩ", 1, description));
            List<string> titanicActors = new List<string>() { "Леонардо ДиКаприо мъж", "Кейт Уинслет жена", "Били Зейн мъж", "Франсис Фишър жена" };

            description = descriptions[1];
            movies.Add(new Movie("Аватар", 2009, 162, "САЩ", 1, description));
            List<string> avatarActors = new List<string>() { "Сам Уортингтън мъж", "Джовани Рибизи мъж", "Сигорни Уивър жена" };

            description = descriptions[2];
            movies.Add(new Movie("Терминаторът", 1984, 107, "САЩ", 1, description));
            List<string> terminatorActors = new List<string>() { "Арнолд Шварценегер мъж", "Майкъл Бийн мъж", "Линда Хамилтън жена" };

            description = descriptions[3];
            movies.Add(new Movie("Ох, на дядо!", 2016, 102, "САЩ", 2, description));
            List<string> OhGrandDadActors = new List<string>() { "Робърт ДеНиро мъж", "Зак Ефрон мъж", "Зоуи Дойч жена", "Обри Плаза жена", "Дермът Мълроуни мъж" };

            description = descriptions[4];
            movies.Add(new Movie("Здрач", 2008, 122, "САЩ", 3, description));
            List<string> duskActors = new List<string>() { "Кристин Стюарт мъж", "Робърт Патинсън мъж", "Били Бърк мъж" };

            description = descriptions[5];
            movies.Add(new Movie("Червената шапчица", 2011, 100, "САЩ", 3, description));
            List<string> redHatActors = new List<string>() { "Аманда Сийфрид жена", "Шайло Фернандес мъж", "Макс Айрънс мъж" };

            description = descriptions[6];
            movies.Add(new Movie("Отмъстителите", 2012, 143, "САЩ", 4, description));
            List<string> avengersActors = new List<string>() { "Крис Хемсуърт мъж", "Крис Евънс мъж", "Коби Смълдерс мъж" };

            description = descriptions[7];
            movies.Add(new Movie("Пришълецът: Завръщането", 2019, 108, "САЩ", 4, description));
            List<string> theAlienActors = new List<string>() { "Сигорни Уийвър жена", "Лилънд Орсър мъж", "Рон Пърлман мъж" };

            description = descriptions[8];
            movies.Add(new Movie("Синята лагуна: Пробуждане", 2012, 85, "САЩ", 5, description));
            List<string> blueLagunaActors = new List<string>() { "Индиана Евънс жена", "Брентън Туейтс мъж", "Денис Ричардс мъж" };

            description = descriptions[9];
            movies.Add(new Movie("Анабел", 2014, 98, "САЩ", 6, description));
            List<string> anabelActors = new List<string>() { "Анабел Уолис жена", "Уорт Хортън мъж", "Алфри Ударт мъж", "Тони Амендола мъж" };

            description = descriptions[10];
            movies.Add(new Movie("Заклинанието", 2013, 112, "САЩ", 6, description));
            List<string> theConjuringActors = new List<string>() { "Вера Фармига жена", "Джои Кинг мъж", "Лили Тейлър жена" };

            description = descriptions[11];
            movies.Add(new Movie("Кухият човек", 2020, 137, "Франция", 7, description));
            List<string> theEmptyManActors = new List<string>() { "Джоел Кортни жена", "Стивън Рут мъж", "Джеймс Бадж Дейл мъж" };

            description = descriptions[12];
            movies.Add(new Movie("Честита смърт", 2017, 96, "САЩ", 8, description));
            List<string> theHappyDeadDayActors = new List<string>() { "Джесика Рот жена", "Израел Брусард мъж", "Руби Модин мъж" };

            description = descriptions[13];
            movies.Add(new Movie("Апостол", 2018, 130, "Великобритания", 9, description));
            List<string> apostleActors = new List<string>() { "Дан Стивънс мъж", "Майкъл Шийн мъж", "Луси Бойнтън жена" };

            description = descriptions[14];
            movies.Add(new Movie("Щурмът", 2011, 101, "Великобритания", 9, description));
            List<string> theAssaultActors = new List<string>() { "Верди Солайман мъж", "Джо Таслим мъж", "Дони Аламсиа жена", "Ианг Дармаван мъж" };

            description = descriptions[15];
            movies.Add(new Movie("За душата", 2020, 100, "САЩ", 10, description));
            List<string> forTheSoulActors = new List<string>() { "Джейми Фокс мъж", "Тина Фей жена", "Греъм Нортън мъж" };

            description = descriptions[16];
            movies.Add(new Movie("Таласъми ООД", 2001, 88, "САЩ", 10, description));
            List<string> monstersOODActors = new List<string>() { "Джон Гудмън мъж", "Били Кристъл мъж", "Стив Бушеми мъж", "Джеймс Кобърн мъж" };

            description = descriptions[17];
            movies.Add(new Movie("Angry Birds: Филмът", 2016, 97, "САЩ", 11, description));
            List<string> angryBirdsActors = new List<string>() { "Джейсън Съдейкис мъж", "Джош Гад мъж" };

            description = descriptions[18];
            movies.Add(new Movie("Аз, проклетникът 2", 2013, 98, "САЩ", 12, description));
            List<string> despicableMeActors = new List<string>() { "Стийв Карел мъж", "Миранда Косгров жена", "Кристен Уиг жена" };

            description = descriptions[19];
            movies.Add(new Movie("Индиана Джоунс", 1981, 127, "САЩ", 13, description));
            List<string> indianaJonesActors = new List<string>() { "Харисън Форд мъж", "Ривър Финикс мъж", "Шон Шатрик Фланъри мъж", "Джордж Хол мъж" };

            description = descriptions[20];
            movies.Add(new Movie("Хобит: Неочаквано пътешествие", 2012, 169, "Нова Зеландия", 14, description));
            List<string> hobbitActors = new List<string>() { "Мартин Фрийман мъж", "Иън Маккелън мъж", "Кейт Бланшет жена" };

            description = descriptions[21];
            movies.Add(new Movie("Властелинът на пръстените: Задругата на пръстена", 2001, 178, "Нова Зеландия", 14, description));
            List<string> lordOfTheRingsActors = new List<string>() { "Хюго Уийвинг мъж", "Илайджа Ууд жена", "Лив Тайлър мъж", "Кристофър Лий мъж", "Йън Маккелън мъж" };

            description = descriptions[22];
            movies.Add(new Movie("Бързи и яростни", 2001, 106, "САЩ", 15, description));
            List<string> fAndFuriousActors = new List<string>() { "Пол Уокър мъж", "Вин Дизел мъж", "Мишел Родригес жена", "Джордана Брустър жена" };

            description = descriptions[23];
            movies.Add(new Movie("Бързи и яростни 6", 2013, 130, "САЩ", 16, description));
            List<string> fAndFurious6Actors = new List<string>() { "Пол Уокър мъж", "Вин Дизел мъж", "Дуейн Джонсън(Скалата) мъж", "Джо Таслим мъж", "Люк Евънс мъж" };

            description = descriptions[24];
            movies.Add(new Movie("Таралежите се раждат без бодли", 1971, 84, "България", 17, description));
            List<string> hedgehogActors = new List<string>() { "Димитър Цонев мъж", "Ивайло Джамбазов мъж", "Андрей Слабаков мъж", "Васил Стойчев мъж" };

            description = descriptions[25];
            movies.Add(new Movie("Куче в чекмедже", 1981, 86, "България", 17, description));
            List<string> dogDrawerActors = new List<string>() { "Веселин Прахов мъж", "Емил Димитров мъж", "Людмила Филипова жена", "Стефан Илиев мъж", "Ружа Делчева жена" };

            description = descriptions[26];
            movies.Add(new Movie("Време разделно", 1988, 160, "България", 18, description));
            List<string> timeDiffActors = new List<string>() { "Йосиф Сърчаджиев мъж", "Руси Чанев мъж", "Иван Кръстев мъж", "Аня Пенчева жена" };

            description = descriptions[27];
            movies.Add(new Movie("Господин за един ден", 1983, 83, "България", 19, description));
            List<string> gentlemenForADayActors = new List<string>() { "Тодор Колев мъж", "Йорданка Стефанова жена", "Иван Григоров мъж", "Велико Стоянов мъж", "Стоян Гъдев мъж" };

            description = descriptions[28];
            movies.Add(new Movie("Тримата от запаса", 1971, 97, "България", 20, description));
            List<string> the3ofTheStockActors = new List<string>() { "Никола Анастасов мъж", "Кирил Господинов мъж", "Георги Парцалев мъж", "Вълчо Камарашев мъж" };

            description = descriptions[29];
            movies.Add(new Movie("Мъжки времена", 1977, 125, "България", 21, description));
            List<string> menTimesActors = new List<string>() { "Григор Вачков мъж", "Мариана Димитрова жена", "Павел Поппандов мъж", "Велко Кънев мъж", "Теофил Баделов мъж" };

            description = descriptions[30];
            movies.Add(new Movie("Списъкът на Шиндлер", 1993, 195, "САЩ", 22, description));
            List<string> schindlerListsActors = new List<string>() { "Бен Кингсли мъж", "Ралф Файнс мъж", "Каролин Гудал жена", "Лиъм Нийсън мъж" };

            description = descriptions[31];
            movies.Add(new Movie("Смело сърце", 1995, 177, "САЩ", 23, description));
            List<string> braveHeartActors = new List<string>() { "Брайън Кокс мъж", "Брендън Глийсън мъж", "Мел Гибсън мъж", "Софи Марсо жена" };

            description = descriptions[32];
            movies.Add(new Movie("Гладиатор", 2000, 155, "Великобритания", 24, description));
            List<string> gladiatorActors = new List<string>() { "Ръсел Кроу мъж", "Хоакин Финикс мъж", "Оливър Рийд мъж", "Ричард Харис мъж" };

            description = descriptions[33];
            movies.Add(new Movie("Беднякът милионер", 2008, 120, "САЩ", 25, description));
            List<string> thePoorRichActors = new List<string>() { "Дев Пател мъж", "Анил Капур мъж", "Саураба Шукла жена", "Раджедранат Зутщи мъж" };

            description = descriptions[34];
            movies.Add(new Movie("Интерстелар", 2014, 169, "САЩ", 26, description));
            List<string> interstellarActors = new List<string>() { "Ан Хатауей жена", "Матю Макконъхи мъж", "Мат Деймън мъж", "Джесика Частейн жена" };

            description = descriptions[35];
            movies.Add(new Movie("Междузвездни войни:Нова надежда", 1977, 125, "САЩ", 27, description));
            List<string> starWars4Actors = new List<string>() { "Марк Хамил мъж", "Харисън Форд мъж", "Кари Фишър жена", };

            description = descriptions[36];
            movies.Add(new Movie("Междузвездни войни:Завръщането на джедаите", 1983, 134, "САЩ", 27, description));
            List<string> starWars6Actors = new List<string>() { "Марк Хамил мъж", "Харисън Форд мъж", "Кари Фишър жена", "Тони Кокс мъж" };

            description = descriptions[37];
            movies.Add(new Movie("Бандата на Оушън", 2001, 116, "САЩ", 28, description));
            List<string> ocean11Actors = new List<string>() { "Джордж Клуни мъж", "Брад Пит мъж", "Мат Деймън мъж", "Анди Гарсия мъж", "Джулия Робъртс жена" };

            description = descriptions[38];
            movies.Add(new Movie("Роки", 1976, 120, "САЩ", 29, description));
            List<string> rockyActors = new List<string>() { "Силвестър Сталоун мъж", "Талия Шайър жена", "Бърт Йънг мъж", "Карл Уедърс мъж" };

            description = descriptions[39];
            movies.Add(new Movie("Мъже на честта", 2000, 129, "САЩ", 30, description));
            List<string> menOfHonorActors = new List<string>() { "Робърт ДеНиро мъж", "Куба Гудинг-мл. мъж", "Чарлийз Терон жена", "Онжаню Елис жена" };

            foreach (var m in movies)
            {
                bc.Add(m);

            }
            bc.AddActorsForMovie(titanicActors, 1);
            bc.AddActorsForMovie(avatarActors, 2);
            bc.AddActorsForMovie(terminatorActors, 3);
            bc.AddActorsForMovie(OhGrandDadActors, 4);
            bc.AddActorsForMovie(duskActors, 5);
            bc.AddActorsForMovie(redHatActors, 6);
            bc.AddActorsForMovie(avengersActors, 7);
            bc.AddActorsForMovie(theAlienActors, 8);
            bc.AddActorsForMovie(blueLagunaActors, 9);
            bc.AddActorsForMovie(anabelActors, 10);
            bc.AddActorsForMovie(theConjuringActors, 11);
            bc.AddActorsForMovie(theEmptyManActors, 12);
            bc.AddActorsForMovie(theHappyDeadDayActors, 13);
            bc.AddActorsForMovie(apostleActors, 14);
            bc.AddActorsForMovie(theAssaultActors, 15);
            bc.AddActorsForMovie(forTheSoulActors, 16);
            bc.AddActorsForMovie(monstersOODActors, 17);
            bc.AddActorsForMovie(angryBirdsActors, 18);
            bc.AddActorsForMovie(despicableMeActors, 19);
            bc.AddActorsForMovie(indianaJonesActors, 20);
            bc.AddActorsForMovie(hobbitActors, 21);
            bc.AddActorsForMovie(lordOfTheRingsActors, 22);
            bc.AddActorsForMovie(fAndFuriousActors, 23);
            bc.AddActorsForMovie(fAndFurious6Actors, 24);
            bc.AddActorsForMovie(hedgehogActors, 25);
            bc.AddActorsForMovie(dogDrawerActors, 26);
            bc.AddActorsForMovie(timeDiffActors, 27);
            bc.AddActorsForMovie(gentlemenForADayActors, 28);
            bc.AddActorsForMovie(the3ofTheStockActors, 29);
            bc.AddActorsForMovie(menTimesActors, 30);
            bc.AddActorsForMovie(schindlerListsActors, 31);
            bc.AddActorsForMovie(braveHeartActors, 32);
            bc.AddActorsForMovie(gladiatorActors, 33);
            bc.AddActorsForMovie(thePoorRichActors, 34);
            bc.AddActorsForMovie(interstellarActors, 35);
            bc.AddActorsForMovie(starWars4Actors, 36);
            bc.AddActorsForMovie(starWars6Actors, 37);
            bc.AddActorsForMovie(ocean11Actors, 38);
            bc.AddActorsForMovie(rockyActors, 39);
            bc.AddActorsForMovie(menOfHonorActors, 40);


            genresId = new List<int>() { 9, 12 };
            bc.MapMovieAndGenre(1, genresId);
            genresId = new List<int>() { 1, 6, 10 };
            bc.MapMovieAndGenre(2, genresId);
            genresId = new List<int>() { 1, 5, 10 };
            bc.MapMovieAndGenre(3, genresId);
            genresId = new List<int>() { 3 };
            bc.MapMovieAndGenre(4, genresId);
            genresId = new List<int>() { 2, 5, 12 };
            bc.MapMovieAndGenre(5, genresId);
            genresId = new List<int>() { 12 };
            bc.MapMovieAndGenre(6, genresId);
            genresId = new List<int>() { 1, 5 };
            bc.MapMovieAndGenre(7, genresId);
            genresId = new List<int>() { 1, 2, 5 };
            bc.MapMovieAndGenre(8, genresId);
            genresId = new List<int>() { 2, 9, 12 };
            bc.MapMovieAndGenre(9, genresId);
            genresId = new List<int>() { 8, 10 };
            bc.MapMovieAndGenre(10, genresId);
            genresId = new List<int>() { 8, 10 };
            bc.MapMovieAndGenre(11, genresId);
            genresId = new List<int>() { 4, 8, 12 };
            bc.MapMovieAndGenre(12, genresId);
            genresId = new List<int>() { 8, 10 };
            bc.MapMovieAndGenre(13, genresId);
            genresId = new List<int>() { 8, 10 };
            bc.MapMovieAndGenre(14, genresId);
            genresId = new List<int>() { 1, 10 };
            bc.MapMovieAndGenre(15, genresId);
            genresId = new List<int>() { 2, 3, 11 };
            bc.MapMovieAndGenre(16, genresId);
            genresId = new List<int>() { 11 };
            bc.MapMovieAndGenre(17, genresId);
            genresId = new List<int>() { 3, 11 };
            bc.MapMovieAndGenre(18, genresId);
            genresId = new List<int>() { 2, 3, 11 };
            bc.MapMovieAndGenre(19, genresId);
            genresId = new List<int>() { 1, 2 };
            bc.MapMovieAndGenre(20, genresId);
            genresId = new List<int>() { 1, 2, 5 };
            bc.MapMovieAndGenre(21, genresId);
            genresId = new List<int>() { 1, 2, 5 };
            bc.MapMovieAndGenre(22, genresId);
            genresId = new List<int>() { 1, 4 };
            bc.MapMovieAndGenre(23, genresId);
            genresId = new List<int>() { 1, 4 };
            bc.MapMovieAndGenre(24, genresId);
            genresId = new List<int>() { 3 };
            bc.MapMovieAndGenre(25, genresId);
            genresId = new List<int>() { 3 };
            bc.MapMovieAndGenre(26, genresId);
            genresId = new List<int>() { 7, 12 };
            bc.MapMovieAndGenre(27, genresId);
            genresId = new List<int>() { 3, 12 };
            bc.MapMovieAndGenre(28, genresId);
            genresId = new List<int>() { 3, 12 };
            bc.MapMovieAndGenre(29, genresId);
            genresId = new List<int>() { 12 };
            bc.MapMovieAndGenre(30, genresId);
            genresId = new List<int>() { 7, 12 };
            bc.MapMovieAndGenre(31, genresId);
            genresId = new List<int>() { 1, 7, 12 };
            bc.MapMovieAndGenre(32, genresId);
            genresId = new List<int>() { 1, 12 };
            bc.MapMovieAndGenre(33, genresId);
            genresId = new List<int>() { 3, 9, 12 };
            bc.MapMovieAndGenre(34, genresId);
            genresId = new List<int>() { 6 };
            bc.MapMovieAndGenre(35, genresId);
            genresId = new List<int>() { 1, 2, 5 };
            bc.MapMovieAndGenre(36, genresId);
            genresId = new List<int>() { 1, 2, 5 };
            bc.MapMovieAndGenre(37, genresId);
            genresId = new List<int>() { 1, 4 };
            bc.MapMovieAndGenre(38, genresId);
            genresId = new List<int>() { 12 };
            bc.MapMovieAndGenre(39, genresId);
            genresId = new List<int>() { 12 };
            bc.MapMovieAndGenre(40, genresId);

            Playlist playlist = new Playlist("Favourites");
            bc.Add(playlist);
        }

        /// <summary>
        /// Метод, проверяващ дали базата е попълнена и ако не е, се извиква метод, който я попълва
        /// </summary>
        private void EnsureDateBaseIsCreated()
        {
            bc = new MovieBusiness();//create database
            if (!bc.CheckIsFulled())
            {
                FullDatabase();
            }
        }
        private void menuStrip1_ItemClicked(object sender, ToolStripItemClickedEventArgs e)
        {

        }

        /// <summary>
        /// Метод, активиращ се при навлизането на курсора на мишката върху бутона "Филми"
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button1_MouseEnter(object sender, EventArgs e)
        {
            button1.BackColor = Color.FromArgb(135, 206, 250);
            groupBox1.Visible = true;
        }
        /// <summary>
        /// Метод, активиращ се при напускането на курсора на мишката от бутона "Филми"
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button1_MouseLeave(object sender, EventArgs e)//филми
        {
            button1.BackColor = Color.FromArgb(240, 255, 255);
        }
        private void groupBox1_MouseHover(object sender, EventArgs e)
        {

        }
        /// <summary>
        /// Метод, активиращ се при навлизането на курсора на мишката върху текстовото поле, служещо за фон на groupBox1
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void textBox2_MouseEnter(object sender, EventArgs e)
        {
            groupBox1.Visible = true;
        }

        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Актьори"
        /// Той отваря нова форма, визуализираща всички актьори в приложението
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button2_Click(object sender, EventArgs e)
        {
            MovieInformation.form1 = this;
            var formActors = new Actors("Form1");
            MovieInformation.actors = formActors;
            MovieInformation.actors.Show();
            this.Hide();
        }

        /// <summary>
        /// Метод, активиращ се при навлизането на курсора на мишката върху формата
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void Form1_MouseEnter(object sender, EventArgs e)
        {
            groupBox1.Visible = false;
            groupBox2.Visible = false;
        }

        private void textBox2_TextChanged(object sender, EventArgs e)
        {

        }

        private void pictureBox1_DragEnter(object sender, DragEventArgs e)
        {

        }

        private void textBox4_TextChanged(object sender, EventArgs e)
        {

        }

        /// <summary>
        /// Метод, активиращ се при навлизането на курсора на мишката върху изображението "хамбургер"
        /// Визуализира групово полета за функционалностите на приложението
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void pictureBox1_MouseEnter(object sender, EventArgs e)
        {
            groupBox2.Visible = true;
            groupBox1.Visible = false;
        }

        /// <summary>
        /// Метод, активиращ се при навлизането на курсора на мишката върху текстовото поле, служещо за фон на главното меню
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void textBox1_MouseEnter(object sender, EventArgs e)
        {
            groupBox1.Visible = false;
            groupBox2.Visible = false;
        }

        private void pictureBox1_Click(object sender, EventArgs e)
        {

        }

        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Изход"
        /// От тук се затваря приложението
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button5_Click(object sender, EventArgs e)
        {
            this.Close();
        }

        private void pictureBox2_DragDrop(object sender, DragEventArgs e)
        {

        }
        private void pictureBox2_DragEnter(object sender, DragEventArgs e)
        {

        }

        private void button1_Click(object sender, EventArgs e)//филми
        {

        }

        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Екшън", който отваря форма, визуализираща всички филми от жанр екшън
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button6_Click(object sender, EventArgs e)//екшън
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 1;
            MovieInformation.GenreLetter = "A";
            MovieInformation.GenreName = "Екшън";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Приключенски", който отваря форма, визуализираща всички филми от жанр приключенски
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button7_Click_1(object sender, EventArgs e)//приключенски
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 2;
            MovieInformation.GenreLetter = "Adv";
            MovieInformation.GenreName = "Приключенски";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Комедия", който отваря форма, визуализираща всички филми от жанр комедия
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button8_Click(object sender, EventArgs e)//комедии
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 3;
            MovieInformation.GenreLetter = "Comedy";
            MovieInformation.GenreName = "Комедии";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Криминален", който отваря форма, визуализираща всички филми от жанр криминален
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button9_Click(object sender, EventArgs e)//криминални
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 4;
            MovieInformation.GenreLetter = "Criminal";
            MovieInformation.GenreName = "Криминални";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Фентъзи", който отваря форма, визуализираща всички филми от жанр фентъзи
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button10_Click(object sender, EventArgs e)//фентъзи
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 5;
            MovieInformation.GenreLetter = "Fantasy";
            MovieInformation.GenreName = "Фентъзи";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Научна фантастика", който отваря форма, визуализираща всички филми от жанр научна фантастика
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button11_Click(object sender, EventArgs e)//научна фантастика
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 6;
            MovieInformation.GenreLetter = "Sci";
            MovieInformation.GenreName = "Научна фантастика";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Исторически", който отваря форма, визуализираща всички филми от жанр исторически
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button12_Click(object sender, EventArgs e)//исторически
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 7;
            MovieInformation.GenreLetter = "History";
            MovieInformation.GenreName = "Исторически";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Ужаси", който отваря форма, визуализираща всички филми от жанр ужаси
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button13_Click(object sender, EventArgs e)//ужаси
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 8;
            MovieInformation.GenreLetter = "Horror";
            MovieInformation.GenreName = "Ужаси";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Романтичен", който отваря форма, визуализираща всички филми от жанр романтичен
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button14_Click(object sender, EventArgs e)//романтика
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 9;
            MovieInformation.GenreLetter = "Romance";
            MovieInformation.GenreName = "Романтика";
            MovieInformation.form1 = this;
            formAction.Show();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Трилър", който отваря форма, визуализираща всички филми от жанр трилър
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button15_Click(object sender, EventArgs e)//трилъри
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 10;
            MovieInformation.GenreLetter = "Thriller";
            MovieInformation.GenreName = "Трилъри";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Анимация", който отваря форма, визуализираща всички филми от жанр анимация
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button16_Click(object sender, EventArgs e)//анимация детско
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 11;
            MovieInformation.GenreLetter = "Cartoon";
            MovieInformation.GenreName = "Анимации";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискането на бутона "Драма", който отваря форма, визуализираща всички филми от жанр драма
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button17_Click(object sender, EventArgs e)//драма
        {
            var formAction = new FormAction();
            MovieInformation.IndexGenre = 12;
            MovieInformation.GenreLetter = "Drama";
            MovieInformation.GenreName = "Драма";
            MovieInformation.form1 = this;
            formAction.Show();
            this.Hide();
        }

        private void pictureBox2_MouseEnter(object sender, EventArgs e)
        {

        }
        /// <summary>
        /// Метод, активиращ се при навлизането на курсора на мишката върху текстово поле
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void textBox5_MouseEnter(object sender, EventArgs e)
        {
            groupBox1.Visible = true;
        }

        /// <summary>
        /// Метод, активиращ се при навлизането на курсора на мишката върху бутон "Актьори", който променя цвета на контролата
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button2_MouseEnter(object sender, EventArgs e)
        {
            button2.BackColor = Color.FromArgb(135, 206, 250);
            groupBox1.Visible = false;
        }
        /// <summary>
        /// Метод, активиращ се при напускането на курсора на мишката от бутон "Актьори", който променя цвета на контролата
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button2_MouseLeave(object sender, EventArgs e)
        {
            button2.BackColor = Color.FromArgb(240, 255, 255);
        }

        /// <summary>
        /// Метод, активиращ се при натискането на изображението "лупа", служещо за търсене на филм
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void pictureBox2_Click(object sender, EventArgs e)
        {
            textBox3.Text = "";
            countMovieInCollection = 1;
            string name = textBoxSearch.Text;
            textBox7.Visible = false;
            pictureBox3.Visible = false;
            MovieInformation.form1 = this;
            ShowMovieInForm(name);

        }
        /// <summary>
        /// Метод, активиращ се при натискането на клавиш от клавиатурата
        /// Служи, за да провери дали е натиснат бутона Enter
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void Form1_KeyDown(object sender, KeyEventArgs e)
        {
        }
        public void ShowMovieInForm(string name)
        {
            Movie movie = bc.GetAllMovies().Where(m => m.MovieTitle.Equals(name)).FirstOrDefault();

            if (movie != null)
            {
                Genre movieGenre = bc.FindGenresOfMovie(movie.Id)[0];
                DefineGenre(movieGenre, movie);
                var film = new Film(movie, "Form1");
                MovieInformation.film = film;
                MovieInformation.film.Show();
                labelError.Visible = false;
            }
            else
            {
                labelError.Visible = true;
            }
            textBoxSearch.Text = "";
        }

        private List<Movie> SearchMovie(string name)
        /// <summary>
        /// Метод, търсещ филм в базата по име
        /// </summary>
        /// <param name="name">Име на филм</param>
        /// <returns>Обект от тип филм</returns>
        private Movie SearchMovie(string name)
        {
            List<Movie> movies = bc.GetAllMovies();
            List<string> moviesTitles = new List<string>();
            List<Movie> moviesSearched = new List<Movie>();
            Movie movieSearched = null;

            if (name.Length == 1)
            {
                return null;
            }

            foreach (var movie in movies)
            {
                moviesTitles.Add(movie.MovieTitle.ToLower());
            }
            int countMovie = 0;
            foreach (var movie in moviesTitles)
            {
                if (movie.ToLower() == name.ToLower())
                {
                    movieSearched = movies[countMovie];
                    moviesSearched.Add(movieSearched);
                }
                else
                {
                    string[] words = movie.Split(' ').ToArray();
                    foreach (var word in words)
                    {
                        if (word.Contains(name.ToLower()))
                        {
                            movieSearched = movies[countMovie];
                            moviesSearched.Add(movieSearched);
                        }
                    }
                }
                countMovie++;
            }
            countMovie = 0;
            moviesSearched.Distinct();
            return moviesSearched;
        }

        /// <summary>
        /// Метод, дефиниращ полетата в помощния клас MovieInformation, служещи за определяне жанра на филма и намирането на съответното изображение
        /// </summary>
        /// <param name="genre">Обект от тип изображение</param>
        /// <param name="movie">Обект от тип филм</param>
        private void DefineGenre(Genre genre, Movie movie)
        {
            countMovieInCollection = 1;
            List<Movie> movies = bc.FindMoviesFromGenre(genre.Id).ToList();
            Movie currMovie = FindMovie(movie.MovieTitle, movies);
            MovieInformation.IndexMovie = countMovieInCollection;

            switch (genre.Title)
            {
                case "Екшън":
                    MovieInformation.LetterMovie = "A";
                    break;
                case "Приключенски":
                    MovieInformation.LetterMovie = "Adv";
                    break;
                case "Комедия":
                    MovieInformation.LetterMovie = "Comedy";
                    break;
                case "Криминален":
                    MovieInformation.LetterMovie = "Criminal";
                    break;
                case "Фентъзи":
                    MovieInformation.LetterMovie = "Fantasy";
                    break;
                case "Научна фантастика":
                    MovieInformation.LetterMovie = "Sci";
                    break;
                case "Исторически":
                    MovieInformation.LetterMovie = "History";
                    break;
                case "Ужаси":
                    MovieInformation.LetterMovie = "Horror";
                    break;
                case "Романтичен":
                    MovieInformation.LetterMovie = "Romance";
                    break;
                case "Трилър":
                    MovieInformation.LetterMovie = "Thriller";
                    break;
                case "Анимация":
                    MovieInformation.LetterMovie = "Cartoon";
                    break;
                case "Драма":
                    MovieInformation.LetterMovie = "Drama";
                    break;
                default:
                    break;
            }
        }

        /// <summary>
        /// Метод, намиращ филм по име при подадена колекция от филми
        /// </summary>
        /// <param name="name">Име на филм</param>
        /// <param name="movies">Колекция от филми</param>
        /// <returns>Обект от тип филм</returns>
        private Movie FindMovie(string name, List<Movie> movies)
        {
            foreach (var movie in movies)
            {
                if (movie.MovieTitle == name)
                {
                    return movie;
                }
                countMovieInCollection++;
            }
            return null;
        }

        private void textBoxSearch_TextChanged(object sender, EventArgs e)
        {    
            string name = textBoxSearch.Text;
            textBox3.Text = "";
            textBox5.Text = "";
            textBox6.Text = "";
            textBox3.Visible = false;
            textBox5.Visible = false;
            textBox6.Visible = false;
            textBox7.Text = textBoxSearch.Text;
            textBox7.Font = new Font(textBox7.Font.FontFamily, 10);
            if (textBoxSearch.Text.Length > 10)
            {
                textBox7.Visible = true;
                pictureBox3.Visible = true;
            }
            else
            {
                textBox7.Visible=false;
                pictureBox3.Visible = false;
            }
            List<Movie> moviesSearched = SearchMovie(name);
            int countMovie = 1;
            if (moviesSearched != null && name != "")
            {
                  
                if (moviesSearched.Count >= 1)
                {
                    textBox3.Visible = true;
                    textBox3.Text = moviesSearched[0].MovieTitle;
                    countMovie++;
                }
                if (moviesSearched.Count >= 2 && moviesSearched[1] != moviesSearched[0])
                {
                    textBox5.Visible = true;
                    textBox5.Text = moviesSearched[1].MovieTitle;
                    countMovie++;
                }
                if (moviesSearched.Count == 3)
                {
                    textBox6.Visible = true;
                    textBox6.Text = moviesSearched[2].MovieTitle;
                }
            }
        }

        /// <summary>
        /// Метод, активиращ се при навлизането на курсора на мишката върху бутона
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button5_MouseEnter(object sender, EventArgs e)
        {
            button5.BackColor = Color.FromArgb(135, 206, 250);
        }

        /// <summary>
        /// Метод, активиращ се при напускането на курсора на мишката от бутона
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void button5_MouseLeave(object sender, EventArgs e)
        {
            button5.BackColor = Color.FromArgb(240, 255, 255);
        }

        /// <summary>
        /// Метод, активиращ се при натискане на бутона "Плейлист", който отваря формата за добавяне на плейлисти
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void buttonPlaylsit_Click(object sender, EventArgs e)
        {
            var playlistForm = new PlaylistForm("Form1");
            playlistForm.Show();
            MovieInformation.form1 = this;
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискане на бутона "Описание", който отваря формата за описанието на приложението
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void buttonDescription_Click(object sender, EventArgs e)
        {
            var formDescription = new DescriptionForm("Form1");
            MovieInformation.form1 = this;
            formDescription.Show();
            this.Hide();
        }
        /// <summary>
        /// Метод, активиращ се при натискане на бутона "Добави филм", който отваря формата за добавяне на нов филм
        /// </summary>
        /// <param name="sender">Обект, изпращащ събитието</param>
        /// <param name="e">Данни на събитието</param>
        private void buttonAddMovie_Click(object sender, EventArgs e)
        {
            var addMovieForm = new AddMovieForm("Form1"); // to doo
            MovieInformation.form1 = this;
            addMovieForm.Show();
            this.Hide();
        }

        /// <summary>
        /// Метод, генериращ 12 произволни филма от базата
        /// </summary>
        /// <returns>Колекция от филми</returns>
        private List<Movie> GetRandomMovies()
        {
            Random rnd = new Random();
            List<Movie> allMovies = bc.GetAllMovies();
            int CountOfRemainedMovies = allMovies.Count;

            List<Movie> toBeGeneratedMovies = new List<Movie>();
            for (int i = 0; i < 12; i++) // 12 times to generate 12 movies
            {
                int randomMovieIndex = rnd.Next(0, CountOfRemainedMovies);
                toBeGeneratedMovies.Add(allMovies[randomMovieIndex]);
                allMovies.RemoveAt(randomMovieIndex);
                CountOfRemainedMovies--;
            }

            return toBeGeneratedMovies;
        }

        /// <summary>
        /// Метод, визуализиращ 12 произволни филма върху началната форма, като при натискане върху даден филм се отваря повече информация за него
        /// </summary>
        private void VisualizeMainPictureBoxes()
        {
            List<Movie> randomMovies = GetRandomMovies();
            //int indexOfPBox = 1;
            for (int movieID = 0; movieID < randomMovies.Count; movieID++)
            {
                Genre firstGenre = bc.FindGenresOfMovie(randomMovies[movieID].Id)[0];
                DefineGenre(firstGenre, randomMovies[movieID]);
                string fileName = $"fotos{MovieInformation.LetterMovie}\\{MovieInformation.LetterMovie}{MovieInformation.IndexMovie}.jpg";
                switch (movieID)
                {
                    case 0:
                        pictureBoxFilm1.Image = Image.FromFile(fileName);
                        // TODO
                        pictureBoxFilm1.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[0].Id)[0];
                            DefineGenre(firstGenre, randomMovies[0]);
                            var film = new Film(randomMovies[0],"Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };

                        break;
                    case 1:
                        pictureBoxFilm2.Image = Image.FromFile(fileName);
                        // TODO
                        pictureBoxFilm2.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[1].Id)[0];
                            DefineGenre(firstGenre, randomMovies[1]);
                            var film = new Film(randomMovies[1],"Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        pictureBoxFilm2.Image = Image.FromFile(fileName);
                        break;
                    case 2:
                        pictureBoxFilm3.Image = Image.FromFile(fileName);
                        pictureBoxFilm3.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[2].Id)[0];
                            DefineGenre(firstGenre, randomMovies[2]);
                            var film = new Film(randomMovies[2],"Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 3:
                        pictureBoxFilm4.Image = Image.FromFile(fileName);
                        pictureBoxFilm4.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[3].Id)[0];
                            DefineGenre(firstGenre, randomMovies[3]);
                            var film = new Film(randomMovies[3], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 4:
                        pictureBoxFilm5.Image = Image.FromFile(fileName);
                        pictureBoxFilm5.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[4].Id)[0];
                            DefineGenre(firstGenre, randomMovies[4]);
                            var film = new Film(randomMovies[4], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 5:
                        pictureBoxFilm6.Image = Image.FromFile(fileName);
                        pictureBoxFilm6.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[5].Id)[0];
                            DefineGenre(firstGenre, randomMovies[5]);
                            var film = new Film(randomMovies[5], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 6:
                        pictureBoxFilm7.Image = Image.FromFile(fileName);
                        pictureBoxFilm7.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[6].Id)[0];
                            DefineGenre(firstGenre, randomMovies[6]);
                            var film = new Film(randomMovies[6], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 7:
                        pictureBoxFilm8.Image = Image.FromFile(fileName);
                        pictureBoxFilm8.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[7].Id)[0];
                            DefineGenre(firstGenre, randomMovies[7]);
                            var film = new Film(randomMovies[7], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 8:
                        pictureBoxFilm9.Image = Image.FromFile(fileName);
                        pictureBoxFilm9.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[8].Id)[0];
                            DefineGenre(firstGenre, randomMovies[8]);
                            var film = new Film(randomMovies[8], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 9:
                        pictureBoxFilm10.Image = Image.FromFile(fileName);
                        pictureBoxFilm10.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[9].Id)[0];
                            DefineGenre(firstGenre, randomMovies[9]);
                            var film = new Film(randomMovies[9], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 10:
                        pictureBoxFilm11.Image = Image.FromFile(fileName);
                        pictureBoxFilm11.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[10].Id)[0];
                            DefineGenre(firstGenre, randomMovies[10]);
                            var film = new Film(randomMovies[10], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    case 11:
                        pictureBoxFilm12.Image = Image.FromFile(fileName);
                        pictureBoxFilm12.Click += (s, e) =>
                        {   // works but is it ok if we use this
                            Genre firstGenre = bc.FindGenresOfMovie(randomMovies[11].Id)[0];
                            DefineGenre(firstGenre, randomMovies[11]);
                            var film = new Film(randomMovies[11], "Form1");
                            MovieInformation.form1 = this;
                            film.Show();
                            this.Hide();
                        };
                        break;
                    default:
                        break;
                }
            }
        }

        private void textBox3_TextChanged(object sender, EventArgs e)
        {

        }

        private void labelError_Click(object sender, EventArgs e)
        {

        }

        private void textBox3_Click(object sender, EventArgs e)
        {
            string nameMovieSearch = textBox3.Text;
            textBox3.Text = "";
            textBox3.Visible = false;
            textBoxSearch.Text = nameMovieSearch;
        }

        private void textBox5_Click(object sender, EventArgs e)
        {
            string nameMovieSearch = textBox5.Text;
            textBox5.Text = "";
            textBox5.Visible = false;
            textBoxSearch.Text = nameMovieSearch;
        }

        private void textBox6_Click(object sender, EventArgs e)
        {
            string nameMovieSearch = textBox6.Text;
            textBox6.Text = "";
            textBox6.Visible = false;
            textBoxSearch.Text = nameMovieSearch;
        }

        private void textBox7_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBoxSearch_MouseEnter(object sender, EventArgs e)
        {
            if (textBoxSearch.Text.Length > 9)
            {
                textBox7.Visible = true;
                pictureBox3.Visible = true;
            }
        }

        private void textBoxSearch_MouseLeave(object sender, EventArgs e)
        {
                textBox7.Visible = false;
            pictureBox3.Visible = false;
        }

        private void textBox7_MouseLeave(object sender, EventArgs e)
        {
            
        }
    }
}
